<script setup>

</script>

<template>
  <div>
    <h1>Користувача угода</h1>

    <p>
      Ласкаво просимо на сайт <a href="https://eseniabila.com.ua/" style="color: #333;">eseniabila.com.ua</a>! Будь ласка, уважно ознайомтеся з нашою Угодою користувача.
    </p>

    <h2>1. Реєстрація та особисті дані</h2>

    <p>
      1.1. Для використання певних функцій сайту, таких як оформлення замовлень, ми можемо просити вас зареєструватися.
    </p>

    <p>
      1.2. Ми збираємо та зберігаємо особисті дані, включаючи ваше ім'я, прізвище, по батькові, адресу електронної пошти та номер телефону. Ми зобов'язуємося захищати конфіденційність ваших даних відповідно до нашої Політики конфіденційності.
    </p>

    <h2>2. Збір та використання даних</h2>

    <p>
      2.1. Ваші особисті дані використовуються виключно для виконання ваших замовлень, надання інформації про товари та послуги, а також для покращення роботи нашого сайту.
    </p>

    <h2>3. Переходи на інші сайти</h2>

    <p>
      3.1. Ми можемо надавати посилання на інші веб-сайти, такі як Telegram, Instagram, Укрпошта, Нова Пошта, для зручності користувачів. Ми не несемо відповідальності за зміст і політику конфіденційності цих веб-сайтів.
    </p>

    <h2>4. Безпека даних</h2>

    <p>
      4.1. Ми предприймаємо заходи забезпечення безпеки ваших даних. Проте ми не можемо гарантувати повну захист інформації через можливі загрози, на які ми не маємо впливу.
    </p>

    <h2>5. Платежі</h2>

    <p>
      5.1. На даний момент наш сайт не обробляє платежі. При можливих змінах у цьому питанні ми повідомимо вас додатково.
    </p>

    <h2>6. Зміни в угоді</h2>

    <p>
      6.1. Ми залишаємо за собою право вносити зміни в нашу угоду користувача. Будь ласка, періодично перевіряйте її на предмет оновлень.
    </p>

    <p>
      Продовжуючи використовувати сайт, ви погоджуєтеся з умовами цієї Угоди користувача.
    </p>
  </div>
</template>


<style scoped>
/* Стили для страницы Угода користувача */

body {
  font-family: 'Arial', sans-serif;
  margin: 0;
  padding: 0;
  background-color: #f4f4f4;
  color: #333;
}

h1 {
  color: #1b4c85;
}

h2 {
  color: #1b4c85;
}

p {
  margin-bottom: 15px;
}

footer {
  background-color: #1b4c85;
  color: white;
  padding: 20px;
  text-align: center;
}

a {
  color: white;
  text-decoration: none;
  font-weight: bold;
}

a:hover {
  text-decoration: underline;
}

div {
  background-color: white;
  max-width: 800px;
  margin: 20px auto;
  padding: 20px;
  box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
  border-radius: 5px;
}

/* Добавьте медиа-запросы для адаптивного дизайна */
@media screen and (max-width: 768px) {
  div {
    padding: 15px;
  }
}

@media screen and (max-width: 480px) {
  div {
    padding: 10px;
  }
}
</style>
